## Taps
tap "aws/tap"
tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

## Languages
brew "clojure"
#cask "java"
#cask "adoptopenjdk8"
#cask "java8"
brew "maven"
brew "node"
brew "python"
brew "ruby", link: true

## Tools / Libraries
brew "coreutils"
brew "diff-so-fancy"
brew "fzf"
brew "watch"

## TUIs
cask "1password-cli"
brew "ag"
brew "awscli"
brew "aws-sam-cli"
brew "boot-clj"
brew "exa"
# brew "fasd"
brew "fx"
brew "git"
brew "gron"
brew "httpie"
brew "jq"
brew "kafka"
brew "leiningen"
brew "mas"
brew "pandoc"
brew "postgresql"
brew "redis"
brew "tldr"
brew "tmux"
brew "tree"
brew "yarn"
brew "pipenv"
brew "python-yq"
brew "yamllint"
brew "xsv"
brew "zsh"
brew "zsh-completions"
brew "z"

## GUIs
cask "1password"
cask "alfred"
cask "dash"
cask "emacs"
cask "firefox", { force: true }
cask "insomnia"
cask "iterm2"
cask "psequel"
cask "spectacle"
cask "transmit"
cask "visual-studio-code"
cask "adoptopenjdk/openjdk/adoptopenjdk8"

mas "Bear", id: 1091189122
mas "Pipifier", id: 1160374471
mas "Ulysses", id: 1225570693

# # Fonts
cask "font-source-code-pro", args: { force: true }
cask "font-source-code-pro-for-powerline", args: { force: true }
cask "font-sourcecodepro-nerd-font", args: { force: true }
cask "font-hack", args: { force: true }
cask "font-hack-nerd-font", args: { force: true }