## Taps
tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

## Languages
brew "clojure"
cask "java"
cask "adoptopenjdk8"
cask "java8"
brew "node"
brew "python"
brew "ruby", link: true

## TUIs
cask "1password-cli"
brew "awscli"
brew "boot-clj"
brew "exa"
brew "fzf"
brew "git"
brew "jq"
brew "kafka"
brew "leiningen"
brew "mas"
brew "postgresql"
brew "redis"
brew "tldr"
brew "tmux"
brew "tree"
brew "yarn"
brew "zsh"
brew "zsh-completions"

## GUIs
cask "1password"
cask "alfred"
cask "dash"
cask "emacs"
cask "firefox"
cask "insomnia"
cask "iterm2"
cask "psequel"
cask "spectacle"
cask "adoptopenjdk/openjdk/adoptopenjdk8"

mas "Bear", id: 1091189122

# # Fonts
cask "font-source-code-pro", args: { force: true }
cask "font-source-code-pro-for-powerline", args: { force: true }
cask "font-sourcecodepro-nerd-font", args: { force: true }
cask "font-hack", args: { force: true }
cask "font-hack-nerd-font", args: { force: true }