## Taps
tap "adoptopenjdk/openjdk"
tap "aljohri/-"
tap "aws/tap"
tap "daviderestivo/emacs-head"
tap "fgeller/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
#tap "wpmedia/perso-tools", "git@github.com:wpmedia/homebrew-perso-tools.git"

## Core
brew "antigen"
brew "awscli"
brew "coreutils"
brew "docker", link: false
brew "git"
brew "gnupg"
brew "gnutls"
brew "grep"
brew "ffmpeg"
brew "fzf"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-completions"

## Emacs
brew "daviderestivo/emacs-head/emacs-head@27", args: ["HEAD", "with-cocoa", "with-imagemagick", "with-jansson"]

## Languages
brew "clojure"
brew "node"
#brew "openjdk@8"
brew "python"
brew "ruby"
brew "scala"
brew "typescript"

## Language Tooling
brew "jenv"
brew "leiningen"
brew "maven"
brew "nvm"
brew "pipenv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "yarn"

## Databases
brew "kafka"
brew "flyway"
brew "mysql"
brew "postgresql", restart_service: true
brew "redis"

## Services
brew "apache-spark"
brew "hive"

## Formatters
brew "black"
brew "prettier"

## TUIs
brew "aws-cdk"
brew "bat"
brew "bfg"
brew "csvkit"
brew "diff-so-fancy"
brew "exa"
brew "fx"
brew "gron"
brew "httpie"
brew "hub"
brew "jq"
brew "fgeller/tap/kt"
brew "lighttpd"
brew "mas"
brew "pandoc"
brew "pngcrush"
brew "pre-commit"
brew "python-yq"
brew "rm-improved"
brew "the_silver_searcher"
brew "watch"
brew "xsv"
brew "yamllint"
brew "youtube-dl"
brew "z"

## Custom Tools
# brew "wpmedia/perso-tools/ec2"
# brew "wpmedia/perso-tools/emr"
# brew "wpmedia/perso-tools/kms"
# brew "wpmedia/perso-tools/nile"

## QuickLook
cask "qlcolorcode" 
cask "qlstephen" 
cask "qlmarkdown" 
cask "quicklook-json" 
cask "webpquicklook" 
cask "suspicious-package" 
cask "apparency" 
cask "quicklookase" 
cask "qlvideo"

## Casks
cask "1password"
cask "1password-cli"
cask "aerial"
cask "alfred"
cask "betterzip"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-sourcecodepro-nerd-font"
cask "iina"
cask "insomnia"
cask "iterm2"
cask "spectacle"
cask "visual-studio-code"
